Revit 2027 API
BuiltInFailures.StairRampFailures.BadBalustersPerTread Property
 Number of Balusters per Tread must be an integer greater than zero.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BadBalustersPerTread { get; }
Public Shared ReadOnly Property BadBalustersPerTread As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BadBalustersPerTread {
	FailureDefinitionId^ get ();
}
static member BadBalustersPerTread : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace